<a href="https://colab.research.google.com/github/yogeshraparia28/Alternate-FX-Rates/blob/main/Data_Exploration.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')

In [3]:
users.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [4]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [6]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [12]:
users.value_counts()
#dt=users.drop_duplicates()
#print(dt)

age  gender  occupation  zip_code
27   F       other       20009       2
21   F       student     55414       2
28   M       student     55414       2
32   M       student     97301       2
44   F       other       60630       2
                                    ..
38   M       executive   L1V3W       1
             engineer    98682       1
                         92064       1
                         30078       1
7    M       student     55436       1
Length: 936, dtype: int64

In [13]:
dt=users.drop_duplicates()
print(dt)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[936 rows x 4 columns]

In [34]:
df= users.groupby(['age'])
df=users.agg({"zip_code":['min','mean']})
print(df)

    zip_code
min    00000

In [35]:
dt=users.age
dt

user_id
1      24
2      53
3      23
4      24
5      33
       ..
939    26
940    32
941    20
942    48
943    22
Name: age, Length: 943, dtype: int64

In [37]:
users.occupation.value_counts().head(1)

dtype('int64')